ox_docs/mathematics/single_variable_calculus/KBrefArcLength.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-26 Sun 09:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Arc Length</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Taproot" />
<link rel="stylesheet" href="https://taproot3.sanity.gq/global.css" type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="site"><a href="https://taproot3.sanity.gq">TR3.5</a></span></div><div class="datarow"><h1 class="title">Arc Length</h1> <h2 class="subtitle"></h2> <span class="author">Taproot</span> <span class="date">2021-09-11 Sat 16:34</date></div>
</div>
<div id="content">
<h1 class="title">Arc Length</h1>

<div id="outline-container-org75c97f3" class="outline-2">
<h2 id="org75c97f3"><span class="section-number-2">1</span> Formula</h2>
<div class="outline-text-2" id="text-1">
<p>
\[\begin{aligned}
   \int_{a}^{b} \sqrt{1+ f'^2(x)} dx
  \end{aligned}\]
</p>
</div>
</div>

<div id="outline-container-orgc3c2550" class="outline-2">
<h2 id="orgc3c2550"><span class="section-number-2">2</span> Derivation</h2>
<div class="outline-text-2" id="text-2">
<p>
Let \(S\) equal the total length of the curve.
</p>

<p>
Start with the pythagorean theorem: for any differentiable function,
\[ S = \sum_{a}^{b} dS \]
where \(dS\) can be calculated using the pythagorean theorem:
</p>

<p>
\[\begin{aligned}
  dS = \sqrt{\Delta y ^2 + \Delta x ^2 }
  \end{aligned}\]
</p>

<p>
We can simplify this by dividing \(dS\) by \(\Delta x\)
</p>

<p>
\[\begin{aligned}
  \frac{dS}{\Delta x} &=  \lim_{\Delta x \to  0} \sqrt{\frac{\Delta y^2}{\Delta x^2} + \frac{\Delta x^2}{\Delta x^2}}\\
  &=  \lim_{\Delta x \to  0} \sqrt{\frac{\Delta y^2}{\Delta x^2} + 1}\\
  &= \sqrt{f'^2(x) + 1}
  \end{aligned}\]
</p>

<p>
Now, to find \(dS\) again, we just have to multiply by \(dx\)
</p>

<p>
\[\begin{aligned}
  dS = \frac{dS}{\Delta x}dx = \sqrt{1+f'^2(x)}dx
  \end{aligned}\]
</p>
</div>
</div>
</div>
</body>
</html>
